app/Controllers/Admin/Dashboard.php

    public function index()
    {
        // Obtener el ID del usuario actual
        $idUsuario = session()->get('id_usuario');

        // Obtener los últimos 5 dispositivos registrados del administrador actual
        $data['ultimosDispositivos'] = $this->dispositivoModel->where('id_usuario', $idUsuario)
                                                             ->orderBy('created_at', 'DESC')
                                                             ->limit(5)
                                                             ->find();
---
SELECT *
FROM `dispositivos`
WHERE `id_usuario` = '1'
ORDER BY `created_at` DESC
 LIMIT 5