app/Controllers/Admin/Dispositivos.php

    public function index()
    {
        // Verificar si el usuario está autenticado
        if (!session()->get('logged_in')) {
            return redirect()->to('/autenticacion/login');
        }

        $idUsuario = session()->get('id_usuario');
        $usuario = $this->usuarioModel->find($idUsuario);

        if (!$usuario) {
            return redirect()->to('autenticacion/login')->with('error', 'Sesión expirada');
        }

        // Solo permitir acceso a admin y supervisor
        if ($usuario['id_rol'] != 1 && $usuario['id_rol'] != 3) {
            return redirect()->to('dashboard')->with('error', 'No tienes permiso para acceder a esta sección');
        }

        if ($usuario['id_rol'] == 3) {
            // Supervisor: ver todos los dispositivos, con info del usuario dueño y admin que lo invitó
            $db = \Config\Database::connect();
            $builder = $db->table('dispositivos d');
            $builder->select('d.*, a.nombre as nombre_admin, a.email as email_admin');
            $builder->join('usuario a', 'a.id_usuario = d.id_usuario');
            $builder->orderBy('d.created_at', 'DESC');
            $dispositivos = $builder->get()->getResultArray();
---
SELECT *
FROM `dispositivos`
WHERE `id_usuario` = '1'
ORDER BY `created_at` DESC

            unset($disp);
        } else {
            // Admin: solo ve sus dispositivos, pero mostrar nombre y email del admin dueño
            $dispositivos = $this->dispositivoModel
                ->select('dispositivos.*, usuario.nombre as nombre_admin, usuario.email as email_admin')
                ->join('usuario', 'usuario.id_usuario = dispositivos.id_usuario', 'left')
                ->where('dispositivos.id_usuario', $idUsuario)
                ->orderBy('dispositivos.created_at', 'DESC')
                ->findAll();
---
SELECT `dispositivos`.*, `usuario`.`nombre` as `nombre_admin`, `usuario`.`email` as `email_admin`
FROM `dispositivos`
LEFT JOIN `usuario` ON `usuario`.`id_usuario` = `dispositivos`.`id_usuario`
WHERE `dispositivos`.`id_usuario` = '1'
ORDER BY `dispositivos`.`created_at` DESC