app/Controllers/Admin.php

    public function gestionarUsuarios()
    {
        if (!session()->get('logged_in') || session()->get('rol') !== 'admin') {
            return redirect()->to('/autenticacion/login');
        }

        $data['usuarios'] = $this->usuarioModel
            ->select('usuario.*, roles.nombre_rol as rol')
            ->join('roles', 'roles.id_rol = usuario.id_rol')
            ->findAll();
---
SELECT `usuario`.*, `roles`.`nombre_rol` as `rol`
FROM `usuario`
JOIN `roles` ON `roles`.`id_rol` = `usuario`.`id_rol`