app/Controllers/Energia.php

SELECT *
FROM `dispositivos`
WHERE `mac_address` = '08:D1:F9:A5:2A:14'
 LIMIT 1
---
    public function recibirNuevosDatos()
    {
        helper('text');
        log_message('info', 'Solicitud recibida en recibirNuevosDatos');

        $json = $this->request->getJSON();
        log_message('debug', 'Datos recibidos en nuevos_datos: ' . print_r($json, true));

        if (!$json) {
            log_message('error', 'No se recibieron datos JSON válidos en nuevos_datos');
            return $this->fail('No se recibieron datos válidos.', 400);
        }

        $requiredFields = ['voltaje', 'corriente', 'potencia', 'kwh', 'mac_address'];
        foreach ($requiredFields as $field) {
            if (!isset($json->$field)) {
                log_message('error', "Campo faltante en nuevos_datos: {$field}");
                return $this->fail("Campo requerido faltante: {$field}", 400);
            }
        }

        $dispositivoModel = new \App\Models\DispositivoModel();
        $dispositivo = $dispositivoModel->where('mac_address', $json->mac_address)->first();

INSERT INTO `energia` (`voltaje`, `corriente`, `potencia`, `kwh`, `fecha`, `mac_address`) VALUES (216.33, 0.0172, 3.71, 0, '2025-05-08 15:18:32', '08:D1:F9:A5:2A:14')
---

        log_message('debug', 'Datos para insertar en energia (nuevos_datos): ' . print_r($energiaData, true));

        if (!$this->energiaModel->insert($energiaData)) {