app/Controllers/Energia.php

    public function recibirNuevosDatos()
    {
        try {
            // Obtener datos JSON del request
            $data = $this->request->getJSON(true);

            if (!$data) {
                return $this->response->setJSON(['error' => 'No se recibieron datos'])->setStatusCode(400);
            }

            // Validar campos requeridos
            $requiredFields = ['voltaje', 'corriente', 'potencia', 'kwh_acumulado', 'mac_address'];
            foreach ($requiredFields as $field) {
                if (!isset($data[$field])) {
                    return $this->response->setJSON(['error' => "Campo requerido faltante: $field"])->setStatusCode(400);
                }
            }

            // Formatear MAC address (quitar separadores y agregar :)
            $mac_sin_formato = strtoupper($data['mac_address']);
            $mac_formateada = implode(':', str_split($mac_sin_formato, 2));

            // Buscar el dispositivo por MAC
            $dispositivo = $this->dispositivoModel->where('mac_address', $mac_formateada)->first();
---
SELECT *
FROM `dispositivos`
WHERE `mac_address` = '08:D1:F9:A5:2A:14'
 LIMIT 1

    public function getLatestDataByDevice($id_dispositivo)
    {
        if (!session()->get('logged_in')) {
            return $this->response->setJSON(['success' => false, 'error' => 'No autorizado'])->setStatusCode(401);
        }

        $dispositivo = $this->dispositivoModel->find($id_dispositivo);
---
SELECT *
FROM `dispositivos`
WHERE `dispositivos`.`id_dispositivo` = '2'