app/Controllers/Energia.php

    public function recibirNuevosDatos()
{
    try {
        $data = $this->request->getJSON(true);

        if (!$data) {
            return $this->response->setJSON(['error' => 'No se recibieron datos'])->setStatusCode(400);
        }

        // Campos requeridos
        $requiredFields = ['voltaje', 'corriente', 'potencia', 'kwh', 'mac_address'];
        foreach ($requiredFields as $field) {
            if (!isset($data[$field])) {
                return $this->response->setJSON(['error' => "Campo requerido faltante: $field"])->setStatusCode(400);
            }
        }

        // Formatear la MAC address - convertir de AABBCCDDEEFF a AA:BB:CC:DD:EE:FF
        $mac_sin_formato = strtoupper($data['mac_address']);
        $mac_formateada = implode(':', str_split($mac_sin_formato, 2));

        log_message('info', 'MAC sin formato recibida: ' . $mac_sin_formato);
        log_message('info', 'MAC formateada: ' . $mac_formateada);

        // Buscar dispositivo con MAC formateada
        $dispositivo = $this->dispositivoModel->where('mac_address', $mac_formateada)->first();
---
SELECT *
FROM `dispositivos`
WHERE `mac_address` = '08:D1:F9:A5:2A:14'
 LIMIT 1

    }

    // Obtener la última lectura
    $ultimaLectura = $this->energiaModel->where('id_dispositivo', $id_dispositivo)
                                      ->orderBy('fecha', 'DESC')
                                      ->first();
---
SELECT *
FROM `energia`
WHERE `id_dispositivo` = '2'
ORDER BY `fecha` DESC
 LIMIT 1

    public function getLatestDataByDevice($id_dispositivo)
    {
        // Verificar si el usuario está autenticado
        if (!session()->get('logged_in')) {
            return $this->response->setJSON([
                'success' => false,
                'error' => 'No autorizado'
            ]);
        }

        // Obtener información del dispositivo
        $dispositivoModel = new \App\Models\DispositivoModel();
        $dispositivo = $dispositivoModel->find($id_dispositivo);
---
SELECT *
FROM `dispositivos`
WHERE `dispositivos`.`id_dispositivo` = '2'

        }

        // Obtener la última lectura del dispositivo
        $lectura = $this->energiaModel->where('id_dispositivo', $id_dispositivo)
                              ->orderBy('fecha', 'DESC')
                              ->first();
---
SELECT *
FROM `energia`
WHERE `id_dispositivo` = '2'
ORDER BY `fecha` DESC
 LIMIT 1