app/Controllers/Supervisor.php

SELECT `usuario`.*, `roles`.`nombre_rol` as `nombre_rol`
FROM `usuario`
JOIN `roles` ON `roles`.`id_rol` = `usuario`.`id_rol`
---
    public function gestionarUsuarios()
    {
        if (!session()->get('logged_in') || session()->get('rol') !== 'supervisor') {
            return redirect()->to('/autenticacion/login');
        }

        $usuarios = $this->usuarioModel
            ->select('usuario.*, roles.nombre_rol as nombre_rol, admin_invitador.nombre as nombre_admin, admin_invitador.apellido as apellido_admin, admin_invitador.email as email_admin')
            ->join('roles', 'roles.id_rol = usuario.id_rol')
            ->join('usuario as admin_invitador', 'admin_invitador.id_usuario = usuario.invitado_por', 'left')
            ->findAll();