app/Models/EnergiaModel.php

INSERT INTO `energia` (`id_dispositivo`, `id_usuario`, `voltaje`, `corriente`, `potencia`, `kwh`, `mac_address`, `fecha`, `limite_superado`) VALUES (2, 1, 0, 2.8321, 0, 0, '08:D1:F9:A5:2A:14', '2025-08-26 13:46:10', 0)
---
    public function insertarDatos($datos)
    {
        return $this->insert($datos);