app/Models/EnergiaModel.php

SELECT `limite_consumo`
FROM `energia`
ORDER BY `id` DESC
---
    public function getLimiteConsumo()
    {
        return $this->db->table($this->table)->select('limite_consumo')->orderBy('id', 'DESC')->get()->getRowArray()['limite_consumo'];

INSERT INTO `energia` (`voltaje`, `corriente`, `potencia`, `kwh`, `fecha`) VALUES (216.75, 0.0295, 6.4, 0.001, '2024-11-26 20:39:04')
---
    public function insertData($data)
    {
        return $this->insert($data);