app/Models/EnergiaModel.php

SELECT SUM(`kwh`) AS `kwh`
FROM `energia`
WHERE `fecha` >= '2024-11-15 00:00:00'
AND `fecha` <= '2024-11-15 23:59:59'
---
    public function getConsumoDiario($id_usuario = null)
{
    $builder = $this->builder();
    if ($id_usuario) {
        $builder->where('id_usuario', $id_usuario);
    }
    $hoy = date('Y-m-d');
    $resultado = $builder->select('SUM(kwh) as total')
                         ->where('DATE(fecha)', $hoy)
                         ->get()
                         ->getRow();

SELECT *
FROM `energia`
ORDER BY `id` DESC
 LIMIT 1
---
    public function getAllDataDesc()
    {
        return $this->orderBy('id', 'DESC')->findAll();

INSERT INTO `energia` (`id_dispositivo`, `id_usuario`, `voltaje`, `corriente`, `potencia`, `kwh_acumulado`, `mac_address`, `fecha`, `limite_superado`) VALUES (2, 1, 214.13, 5.2989, 1134.68, 2.532753, '08:D1:F9:A5:2A:14', '2025-10-17 13:05:49', 0)
---
    public function insert($data = null, bool $returnID = true, bool $overwrite = false)
    {
        if (is_array($data)) {
            if (isset($data['id_dispositivo'])) {
                $data['id_dispositivo'] = (int)$data['id_dispositivo'];
            }
            if (isset($data['id_usuario'])) {
                $data['id_usuario'] = (int)$data['id_usuario'];
            }
        }
        return parent::insert($data, $returnID, $overwrite);